function han(text) {
    let p1 = /([A-Za-z_])([\u4e00-\u9fa5]+)/gi; //字母 汉字
    let p2 = /([\u4e00-\u9fa5]+)([A-Za-z_])/gi; //汉字 字母
    let p3 = /([0-9_])([\u4e00-\u9fa5]+)/gi; //数字 汉字
    let p4 = /([\u4e00-\u9fa5]+)([0-9_])/gi; //汉字 数字
    let p5 = /([A-Za-z_])([`~!@#$%^&*()_\-+=?:"{}|,./;'\\[\]·~！@#￥%&*——\-+={}‘’])([\u4e00-\u9fa5]+)/gi; //英文+符号 汉字
    let p6 = /([\u4e00-\u9fa5]+)([`~!@#$%^&*()_\-+=?:"{}|,./;'\\[\]·~！@#￥%&*——\-+={}‘’])([A-Za-z_])/gi; //汉字 符号+英文
    let p10 = /([0-9_])([`~!@#$%^&*()_\-+=?:"{}|,./;'\\[\]·~！@#￥%&*——\-+={}‘’])([\u4e00-\u9fa5]+)/gi; //数字+符号 汉字
    let p11 = /([\u4e00-\u9fa5]+)([`~!@#$%^&*()_\-+=?:"{}|,./;'\\[\]·~！@#￥%&*——\-+={}‘’])([0-9_])/gi; //汉字 符号+数字
    let p7 = /([\u4e00-\u9fa5]+)([<])([a])/gi; //汉字 括号
    let p8 = /([a])([>])([\u4e00-\u9fa5]+)/gi; //括号 汉字
    let p9 = /([A-Za-z_])([0-9_])([\u4e00-\u9fa5]+)/gi; //英文+数字 汉字
    return text.replace(p9, '$1$2 $3').replace(p1, '$1 $2').replace(p2, "$1 $2").replace(p3, "$1 $2").replace(p4, "$1 $2").replace(p5, "$1$2 $3").replace(p6, "$1 $2$3").replace(p11, "$1 $2$3").replace(p10, "$1$2 $3").replace(p7, "$1 $2$3").replace(p8, "$1$2 $3");
}

export default han;